---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeSegmentLengthDimensionsEnabled
source: html/6c019ad6-868a-6b30-1059-634084dc3bf3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeSegmentLengthDimensionsEnabled Property

"Segment Length Dimensions"

## Syntax (C#)
```csharp
public static ForgeTypeId BendingDetailTypeSegmentLengthDimensionsEnabled { get; }
```